app/Models/ModelLokasi.php

INSERT INTO `tbl_lokasi` (`nama_lokasi`, `alamat_lokasi`, `latitude`, `longitude`, `foto_lokasi`) VALUES ('coba', 'coba', '-7.106337330562348', '113.33908099999998', '1778245318_bc68b764a8e581ecee39.jpg')
---
    public function insertData($data)
    {
        $this->db->table('tbl_lokasi')->insert($data);

SELECT *
FROM `tbl_lokasi`
WHERE `id_lokasi` = '1'
---
    public function getDataById($id_lokasi)
    {
        return $this->db->table('tbl_lokasi')
            ->where('id_lokasi', $id_lokasi)
            ->get()->getRowArray();

UPDATE `tbl_lokasi` SET `id_lokasi` = '1', `nama_lokasi` = 'Lokasi A', `alamat_lokasi` = 'Jl. Lokasi A', `latitude` = '-7.196446094272064', `longitude` = '113.2443205943863', `foto_lokasi` = '1778244528_87eeae754f168ef026e9.jpg'
WHERE `id_lokasi` = '1'
---
    public function updateData($data)
    {
        $this->db->table('tbl_lokasi')
            ->where('id_lokasi', $data['id_lokasi'])
            ->update($data);

DELETE FROM `tbl_lokasi`
WHERE `id_lokasi` = '4'
AND `id_lokasi` = '4'
---
    public function deleteData($data)
    {
        $this->db->table('tbl_lokasi')
            ->where('id_lokasi', $data['id_lokasi'])
            ->delete($data);